erp3l/src/Catalogs/ПланыВидовХарактеристикБД/ПланыВидовХарактеристикБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыВидовХарактеристикБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИерархическийСправочник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ОбменТаблДок</name>
      <description>Табличные документы (1С или Microsoft Excel)</description>
    </items>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СоответствиеВнешнимИБ/СоответствиеВнешнимИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствиеВнешнимИБ</name>
  <basedOn>Catalog.ПеречисленияБД</basedOn>
  <basedOn>Catalog.СправочникиБД</basedOn>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаВИБ</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыСчетовБД</types>
      <types>CatalogRef.ТабличныеЧастиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
      <types>CatalogRef.РегистрыСведенийБД</types>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаКонсолидации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоВидыСубконто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОперандаИнтерфейс</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаСоответствияВИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживатьИерархиюВИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияПоGUID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневойКаталог</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСоответствияРодитель</name>
    <type>
      <types>CatalogRef.СоответствиеВнешнимИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаТек</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыСчетовБД</types>
      <types>CatalogRef.ТабличныеЧастиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
      <types>CatalogRef.РегистрыСведенийБД</types>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеРегистраВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеРегистраТек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеНеактуальны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоИерархииВИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеРеквизитов</name>
    <attributes>
      <name>РеквизитОбъектаКонсолидации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитОбъектаВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьДляСинхронизации</name>
      <comment>Ключевой = НЕ НеИспользоватьДляСинхронизации и Сопоставлено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеКонсолидация</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеВИБ</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримитивныйТип</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитикиВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполнения</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПолейИсточника</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеКонсолидация1</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеЗначенийПеречислений</name>
    <attributes>
      <name>ЗначениеВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеТекущейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТекущейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияСвязанныхОбъектов</name>
    <attributes>
      <name>ТипОбъектаВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбъектаВИБ</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
        <types>CatalogRef.РегистрыСведенийБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъектаТек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбъектаТек</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
        <types>CatalogRef.РегистрыСведенийБД</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеРегистраВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеРегистраТек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ПланыВидовХарактеристикБД/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
		
		ТипБД=Параметры.Отбор.Владелец;
		
		Если ТипБД.ВерсияПлатформы=Перечисления.ПлатформыВнешнихИнформационныхБаз.ADO Тогда
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Для выбранного типа информационной базы доступны только таблицы ADO'"), Отказ,,СтатусСообщения.Информация);
			Возврат;
			
		КонецЕсли;
		
		ОбновитьОтборПоВладельцу();
		
		Элементы.ТипБД.Доступность=Ложь;
		
	Иначе
		
				
		Элементы.ТипБД.Доступность=Истина;
		ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ;
		ОбновитьОтборПоВладельцу();
		
		Если Параметры.Свойство("Контролируемые") Тогда
			Элементы.ТипБД.Доступность=Ложь;
			ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(Список.Отбор, "Контролируемый", Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);	
		КонецЕсли;
	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборПоВладельцу()
	
	ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(Список.Отбор,"Владелец",ТипБД,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		
	Если ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		Элементы.СписокЗагрузитьИЗВИБ.Заголовок = НСтр("ru = 'Обновить по данным текущей ИБ'");
		
	Иначе
		
		Элементы.СписокЗагрузитьИЗВИБ.Заголовок = НСтр("ru = 'Обновить по данным внешней ИБ'");
		
	КонецЕсли;
	
	Если ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		Заголовок = НСтр("ru = 'Планы видов характеристик текущей информационной базы'");
		Элементы.Соответствие.Видимость=Ложь;
		Элементы.Ссылка.Заголовок=Нстр("ru = 'Планы видов характеристик текущей ИБ'");
		
	Иначе
		
		Заголовок = НСтр("ru = 'Планы видов характеристик внешней информационной базы'");
		Элементы.Соответствие.Видимость=Истина;
		Элементы.Ссылка.Заголовок = НСтр("ru = 'Планы видов характеристик внешней ИБ'");
		
	КонецЕсли;
			
КонецПроцедуры // ОбновитьОтборПоВладельцу() 

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокПВХ(ТипБД)
	
	ОбщегоНазначенияУХ.ЗаполнитьСписокПлановВидовХарактеристикБД(ТипБД);
		
КонецПроцедуры // ЗаполнитьСписокСправочников()


/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Если Поле.Имя="Соответствие" Тогда
		
		СтандартнаяОбработка=Ложь;
		
		ТекСоответствие=Элементы.Список.ТекущиеДанные.Соответствие;
		
		Если НЕ ЗначениеЗаполнено(ТекСоответствие) Тогда
			
			СтруктураСоответствие=Новый Структура;
			СтруктураСоответствие.Вставить("ОписаниеОбъектаВИБ",Элементы.Список.ТекущиеДанные.Ссылка);
			СтруктураСоответствие.Вставить("Владелец",ТипБД);
			СтруктураСоответствие.Вставить("ТипОбъектаВИБ","ПланВидовХарактеристик");
			
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", СтруктураСоответствие);
			Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбновитьСписок", ЭтотОбъект);
			ОткрытьФорму("Справочник.СоответствиеВнешнимИБ.ФормаОбъекта", 
						ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе

			ОткрытьФорму("Справочник.СоответствиеВнешнимИБ.ФормаОбъекта",Новый Структура("Ключ",ТекСоответствие));
			
		КонецЕсли;
		
	Иначе
		
		ОткрытьФорму("Справочник.ПланыВидовХарактеристикБД.ФормаОбъекта",Новый Структура("Ключ",Элементы.Список.ТекущиеДанные.Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписок(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИЗВИБ(Команда)
	
	Если НЕ ЗначениеЗаполнено(ТипБД) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан тип внешней информационной базы'"));
		Возврат;
		
	Иначе
		
		ЗаполнитьСписокПВХ(ТипБД);
		Элементы.Список.Обновить();
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ТипБДПриИзменении(Элемент)
	
	ОбновитьОтборПоВладельцу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеОтсутствующие(Команда)
	ОбщегоНазначенияУХ.ПометитьНаУдалениеОтсутствующие("Справочник.ПланыВидовХарактеристикБД");
	Элементы.Список.Обновить();
КонецПроцедуры
